app/views/runners/index.html.erb

<br>
<% @favor = Favor.where("skill = ?", @runners.skill) %>
---
SELECT  "favors".* FROM "favors" WHERE (skill = 'Cleaning') ORDER BY "favors"."id" ASC LIMIT ?  [["LIMIT", 1]]

	<% if f.runner_id == nil %>
	<% @juan = Juan.find_by("id = ?", f.juan_id) %>
---
SELECT  "juans".* FROM "juans" WHERE (id = 1) LIMIT ?  [["LIMIT", 1]]