app/views/runners/show.html.erb

	<h4> Favor Currently Doing </h4>
	<% @favor = Favor.where("skill = ?", @runners.skill) %>
	<% @juan = Juan.find_by("id = ?", @favor.first.juan_id) %>
---
SELECT  "favors".* FROM "favors" WHERE (skill = 'Cleaning') ORDER BY "favors"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT  "juans".* FROM "juans" WHERE (id = 1) LIMIT ?  [["LIMIT", 1]]