app/views/juans/index.html.erb

    </thead>
<% @runner = Runner.all %>
---
SELECT "runners".* FROM "runners"