app/views/juans/index.html.erb

SELECT "runners".* FROM "runners" WHERE "runners"."isAvailable" = ?  [["isAvailable", true]]
---

<% @runner = Runner.where(isAvailable: true) %>