app/views/juans/show.html.erb

	<p>Contact: <%= @juans.contact %></p>
	<% @favor = Favor.where("juan_id = ?", @juans.id) %>
---
SELECT "favors".* FROM "favors" WHERE (juan_id = 1)