app/controllers/favors_controller.rb

SELECT  "juans".* FROM "juans" WHERE "juans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def new
    	@favor = Favor.new
    	@juans = Juan.find(session[:id])

SELECT  "juans".* FROM "juans" WHERE "juans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "favors" ("desc", "juan_id", "created_at", "updated_at", "skill", "pay") VALUES (?, ?, ?, ?, ?, ?)  [["desc", "Need help"], ["juan_id", 1], ["created_at", 2017-03-23 13:12:20 UTC], ["updated_at", 2017-03-23 13:12:20 UTC], ["skill", "Cleaning"], ["pay", 150]]
---
def create
   # @juan = Juan.new(params[:juan_params])
    @favor = Favor.new()
	@favor.desc = params[:favor][:desc]
	@favor.skill = params[:favor][:skill]
	@favor.juan_id = Juan.find(session[:id]).id
	@favor.pay = params[:favor][:pay]

	if @favor.save

SELECT  "favors".* FROM "favors" WHERE "favors"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
def edit
	@favor = Favor.find(params[:id])

SELECT  "favors".* FROM "favors" WHERE "favors"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "favors" SET "desc" = ?, "updated_at" = ? WHERE "favors"."id" = ?  [["desc", "cook dinner pls"], ["updated_at", 2017-03-23 11:18:58 UTC], ["id", 6]]
---
def update
	@favor = Favor.find(params[:id])
	@favor.desc = params[:favor][:desc]
	@favor.skill = params[:favor][:skill]
	@favor.pay = params[:favor][:pay]

	if @favor.save

SELECT "favors".* FROM "favors"
---
def index
	@favor = Favor.all

SELECT  "favors".* FROM "favors" WHERE "favors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "favors" WHERE "favors"."id" = ?  [["id", 1]]
---
def delete
	@favor = Favor.find(params[:id])
	@favor.destroy

SELECT  "favors".* FROM "favors" WHERE "favors"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
DELETE FROM "favors" WHERE "favors"."id" = ?  [["id", 14]]
SELECT  "runners".* FROM "runners" WHERE "runners"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "runners" SET "hasTask" = ?, "updated_at" = ? WHERE "runners"."id" = ?  [["hasTask", false], ["updated_at", 2017-03-23 15:21:10 UTC], ["id", 5]]
---
def finish
	@favor = Favor.find(params[:id])
	@favor.destroy

	@runner = Runner.find(session[:id])
	@runner.hasTask = false
	@runner.save