app/controllers/juans_controller.rb

INSERT INTO "juans" ("fname", "lname", "username", "password", "created_at", "updated_at", "address") VALUES (?, ?, ?, ?, ?, ?, ?)
---
def create
   # @juan = Juan.new(params[:juan_params])
    @juan = Juan.new()
	@juan.fname = params[:juan][:fname]
	@juan.lname = params[:juan][:lname]
	@juan.address = params[:juan][:address]
	@juan.username = params[:juan][:username]
	@juan.password = params[:juan][:password]
	@juan.contact = params[:juan][:contact]

	if @juan.save

SELECT  "juans".* FROM "juans" WHERE "juans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
def show
   @juans = Juan.find(params[:id])

SELECT  "juans".* FROM "juans" WHERE "juans"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
def index
    @juans = Juan.find(session[:id])

SELECT  "juans".* FROM "juans" WHERE "juans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
def edit
	@juan = Juan.find(session[:id])

SELECT  "juans".* FROM "juans" WHERE "juans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "juans" SET "contact" = ?, "updated_at" = ? WHERE "juans"."id" = ?  [["contact", "09286657207"], ["updated_at", 2017-03-23 11:24:53 UTC], ["id", 1]]
---
def update
	@juan = Juan.find(session[:id])
	#@juan.update_attributes(params[:juan])
	@juan.fname = params[:juan][:fname]
	@juan.lname = params[:juan][:lname]
	@juan.address = params[:juan][:address]
	@juan.contact = params[:juan][:contact]

	if @juan.save