app/controllers/logins_controller.rb

	def create
		@juan = Juan.find_by(username: params[:login][:username])
		@runner = Runner.find_by(username: params[:login][:username])
---
SELECT  "juans".* FROM "juans" WHERE "juans"."username" = ? LIMIT ?  [["username", "Justin"], ["LIMIT", 1]]
SELECT  "runners".* FROM "runners" WHERE "runners"."username" = ? LIMIT ?  [["username", "Justin"], ["LIMIT", 1]]