app/controllers/runners_controller.rb

def create
   # @juan = Juan.new(params[:juan_params])
    @runner = Runner.new()
	@runner.fname = params[:runner][:fname]
	@runner.lname = params[:runner][:lname]
	@runner.address = params[:runner][:address]
	@runner.username = params[:runner][:username]
	@runner.password = params[:runner][:password]
	@runner.contact = params[:runner][:contact]
	@runner.skill = params[:runner][:skill]
	@runner.hasTask = false

	if @runner.save
---
INSERT INTO "runners" ("fname", "lname", "contact", "username", "password", "created_at", "updated_at", "address", "skill", "hasTask") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

def show
   @runners = Runner.find(params[:id])
---
SELECT  "runners".* FROM "runners" WHERE "runners"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

def index
    @runners = Runner.find(session[:id])
---
SELECT  "runners".* FROM "runners" WHERE "runners"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

def edit
	@runner = Runner.find(session[:id])
---
SELECT  "runners".* FROM "runners" WHERE "runners"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

def update
	@runner = Runner.find(session[:id])
	#@juan.update_attributes(params[:juan])
	@runner.fname = params[:runner][:fname]
	@runner.lname = params[:runner][:lname]
	@runner.address = params[:runner][:address]
	@runner.contact = params[:runner][:contact]
	@runner.skill = params[:runner][:skill]
	@runner.isAvailable = params[:runner][:isAvailable]

	if @runner.save
---
SELECT  "runners".* FROM "runners" WHERE "runners"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "runners" SET "skill" = ?, "isAvailable" = ?, "updated_at" = ? WHERE "runners"."id" = ?  [["skill", "General"], ["isAvailable", false], ["updated_at", 2017-03-23 12:38:18 UTC], ["id", 1]]

def accept
	@favor = Favor.find(params[:id])
	@runner = Runner.find(session[:id])

	@favor.runner_id = @runner.id
	@runner.hasTask = true

	if @runner.save && @favor.save
---
SELECT  "favors".* FROM "favors" WHERE "favors"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT  "runners".* FROM "runners" WHERE "runners"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "favors" SET "runner_id" = ?, "updated_at" = ? WHERE "favors"."id" = ?  [["runner_id", 1], ["updated_at", 2017-03-23 14:18:47 UTC], ["id", 12]]
UPDATE "runners" SET "hasTask" = ?, "updated_at" = ? WHERE "runners"."id" = ?  [["hasTask", true], ["updated_at", 2017-03-23 14:28:48 UTC], ["id", 1]]