app/controllers/skills_controller.rb

def create
   # @juan = Juan.new(params[:juan_params])
    @skill = Skill.new()
	@skill.name = params[:skill][:name]

	if @skill.save
---
INSERT INTO "skills" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Cleaning"], ["created_at", 2017-03-23 10:02:36 UTC], ["updated_at", 2017-03-23 10:02:36 UTC]]

def index
    @skills = Skill.all
---
SELECT "skills".* FROM "skills"